#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;
vector<long> arr;

bool comparator(int left, int right){
    return left > right;
}

int main(){
    int n,k, answer = 0;
    cin >> n >> k;
    arr.resize(n);
    for (int i = 0; i < n; i++) {
        cin >> arr[i];
    }
    sort(arr.begin(), arr.end(), comparator);
    for (int i = 0; i < n; i++)
        if ((i+1) % k != 0) answer += arr[i];
    cout << answer << endl;
    return 0;
}

//У Билла большая семья: трое сыновей, девять внуков. И всех надо кормить. Поэтому Билл раз в неделю ходит в магазин.
//
//Однажды Билл пришел в магазин и увидел, что в магазине проводится акция под названием «каждый k-й товар бесплатно».
// Изучив правила акции, Билл выяснил следующее. Пробив на кассе товары, покупатель получает чек.
// Пусть в чеке n товаров, тогда n/k округленное вниз самых дешевых из них достаются бесплатно.
//
//Например, если в чеке пять товаров за 200, 100, 1000, 400 и 100 рублей, соответственно, и k = 2,
// то бесплатно достаются оба товара по 100 рублей, всего покупатель должен заплатить 1600 рублей.
//
//Билл уже выбрал товары, и направился к кассе, когда сообразил, что товары, которые он хочет купить,
// можно разбить на несколько чеков, и благодаря этому потратить меньше денег.
//
//Помогите Биллу выяснить, какую минимальную сумму он сможет заплатить за выбранные товары,
// возможно разбив их на несколько чеков.
//
//Формат ввода
//Первая строка входного файла содержит два целых числа n, k (1 ≤ n ≤ 100 000, 2 ≤ k ≤ 100) — количество товаров,
// которые хочет купит Билл и параметр акции «каждый k-й товар бесплатно».
//
//Следующая строка содержит n целых чисел ai (1 ≤ ai ≤ 10 000) — цены товаров, которые покупает Билл.